"""
Сборник вопросов для прохождня теста
:noindex:
"""

TEST_QUESTION = [
    # question 1
    {
        "question": "Самая большая планета солечной системы?",
        "options": [
            "Солнце", "Титан", "ИО", "Земля", "Cатурн",
            "Нептун", "Юпитер", "Уран"
        ],
        "correct_answer": "Юпитер"
    },
    # question 2
    {
        "question": (
            "Как называется ближайшая к Земле звезда, "
            "не считая Солнца?"
        ),
        "options": [
            "Проксима Центавра", "Альфа Центавра", "Сириус",
            "Бетельгейзе", "Полярная звезда", "Вега",
            "Джастин Бибер", "Денеб", "Арктур", "Ригель",
            "Нет ближайших звёзд"
        ],
        "correct_answer": "Проксима Центавра"
    },
    # question 3
    {
        "question": "Какой газ является основным компонентом атмосферы Земли?",
        "options": [
            "Кислород", "Азот", "Углекислый газ", "Аргон",
            "Неон", "Водород", "Гелий", "Метан",
            "Озон", "Аммиак", "Хлор"
        ],
        "correct_answer": "Азот"
    },
    # question 4
    {
        "question": "Что представляет собой процесс фотосинтеза?",
        "options": [
            "Процесс выделения кислорода из воды",
            "Процесс превращения углекислого газа в кислород",
            "Процесс превращения световой энергии в химическую",
            "Процесс превращения кислорода в углекислый газ",
            "Процесс превращения воды в углекислый газ"
        ],
        "correct_answer": "Процесс превращения световой энергии в химическую"
    },
    # question 5
    {
        "question": "Как называется ближайшая к Земле галактика?",
        "options": [
            "Туманность Андромеды", "Туманность Ориона",
            "Сомбреро", "Большое Магелланово Облако",
            "Млечный Путь", "Туманность Тарантулы",
            "Туманность Краба", "Малое Магелланово Облако",
            "Эльсистема", "Галактика Антенн"
        ],
        "correct_answer": "Туманность Андромеды"
    },
    # question 6
    {
        "question": "Как называется самая большая планета Солнечной системы?",
        "options": [
            "Марс", "Венера", "Юпитер", "Сатурн", "Уран",
            "Нептун", "Плутон", "Земля", "Меркурий", "Луна",
            "Солнце"
        ],
        "correct_answer": "Юпитер"
    },
    # question 7
    {
        "question": "Как называется спутник Земли?",
        "options": [
            "Титан", "Луна", "Фобос", "Ганимед",
            "Ио", "Европа", "Деймос", "Тритон",
            "Энцелад", "Протей"
        ],
        "correct_answer": "Луна"
    },
    # question 8
    {
        "question": "Как называется положительный эемент ядра атома?",
        "options": [
            "Протон", "Электрон", "Нейтрон", "Позитрон",
            "Кварк", "Глюон", "Бозон", "Фермион",
            "Квазар", "Субатомная частица"
        ],
        "correct_answer": "Протон"
    },
    # question 9
    {
        "question": (
            "Какая из перечисленных планет"
            "не является газовым гигантом?"
        ),
        "options": [
            "Юпитер", "Сатурн", "Марс", "Нептун",
            "Уран", "Гелий", "Газовый гигант",
        ],
        "correct_answer": "Марс"
    },
    # question 10
    {
        "question": "Какой элемент используется для создания ядерного оружия?",
        "options": [
            "Углерод", "Гелий", "Уран", "Кислород",
            "Водород", "Литий", "Азот", "Неон",
            "Криптон", "Радон"
        ],
        "correct_answer": "Уран"
    },
]
